test/test_transform/test_data/test_payment_data2.json

{
    "timestamp": "2024-02-22 14:50:20.010165",
    "payment": [
        {
            "company_ac_number": 72098432,
            "counterparty_ac_number": 27214177,
            "counterparty_id": 4,
            "created_at": "2024-02-22 14:48:10.434000",
            "currency_id": 2,
            "last_updated": "2024-02-22 14:48:10.434000",
            "paid": false,
            "payment_amount": "82207.80",
            "payment_date": "2024-02-23",
            "payment_id": 9881,
            "payment_type_id": 1,
            "transaction_id": 9881
        },
        {
            "company_ac_number": 65525440,
            "counterparty_ac_number": 19472783,
            "counterparty_id": 13,
            "created_at": "2024-02-22 15:59:10.043000",
            "currency_id": 3,
            "last_updated": "2024-02-22 15:59:10.043000",
            "paid": false,
            "payment_amount": "319428.33",
            "payment_date": "2024-02-26",
            "payment_id": 9882,
            "payment_type_id": 1,
            "transaction_id": 9882
        }
    ]
}
